tests/Artillery/StoreFile/store_files.yml
# Locally:
# artillery run tests/Artillery/StoreFile/store_files.yml
# Debug> DEBUG=http* artillery run tests/Artillery/StoreFile/store_files.yml
config:
  target: "{{APP_URL}}/api"
  phases:
    - duration: 1
      arrivalRate: 5
  processor: "./functions.js"
scenarios:
  - flow:
      - post:
          url: "/files"
          beforeRequest:
            - "loadEnv"
            - "generateRandomFile"
          formData:
            name: "FileNameValue"
            file:
              path: "file_to_upload.dat"
          headers:
            Authorization: "Basic dGVzdGVyOnNlY3JldA==" # tester/secret