tests/Artillery/StoreFile/store_files.yml
config:
  target: "http://artillerylaravel/api"
  phases:
    - duration: 1
      arrivalRate: 1
      name: "Basic test"
  http:
    tls:
      rejectUnauthorized: false
  processor: "./functions.js"
#  files:
#    - "@./file_to_upload.dat"
scenarios:
  - flow:
#      - function: "generateRandomFile"
      - log: "Storing new file..."
      - post:
          url: "/files"
          beforeRequest: "generateRandomFile"
#          afterResponse: "logHeaders"
          formData:
            name: "FileNameValue"
            file:
              path: "file_to_upload.dat"
          headers:
            Authorization: "Basic dGVzdGVyOnNlY3JldA==" # tester/secret