tests/Artillery/StoreFile/store_files.yml
config:
  target: "http://artillerylaravel/api"
  phases:
    - duration: 1
      arrivalRate: 5
  processor: "./functions.js"
scenarios:
  - flow:
      - post:
          url: "/files"
          beforeRequest: "generateRandomFile"
          formData:
            name: "FileNameValue"
            file:
              path: "file_to_upload.dat"
          headers:
            Authorization: "Basic dGVzdGVyOnNlY3JldA==" # tester/secret